Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །ཞེས་བྱ་བ་དེ་ལྟར་ཡང་དམིགས་པའི་ཚུལ་གྱིས་གནས་པར་མི་བྱའོ། །སེམས་ཅན་ཚད་མེད་གྲངས་མེད་པ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་རབ་ཏུ་དགོད་པར་བྱའོ།
en: They should not, by way of apprehending, dwell on the notion, ‘I should establish inestimable, countless beings in unsurpassed, complete enlightenment.’

source: །ཞེས་བྱ་བར་དམིགས་པའི་ཚུལ་གྱིས་གནས་པར་མི་བྱའོ། །མིག་ལྔ་བསྒྲུབ་པར་བྱ་སྟེ། ལྔ་གང་ཞེ་ན་ཤའི་མིག་དང་ལྷའི་མིག་དང་ཤེས་རབ་ཀྱི་མིག་དང་། ཆོས་ཀྱི་མིག་དང་སངས་རྒྱས་ཀྱི་མིག་བསྒྲུབ་པར་བྱའོ།
en: They should not, by way of apprehending, dwell on the notion, ‘I should cultivate the five eyes,’ which, if you were to ask, is to say, ‘I should cultivate the eye of flesh, the eye of divine clairvoyance, the eye of the Dharma, the eye of wisdom, and the eye of the buddha.’

source: །ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཡོངས་སུ་བསྒྲུབ་པར་བྱའོ།
en: Nor should they, by way of apprehending, dwell on the notions, ‘I should master all the meditative stabilities.

source: །ཏིང་ངེ་འཛིན་གང་དང་གང་གིས་རྣམ་པར་རྩེ་བར་འདོད་པའི་ཏིང་ངེ་འཛིན་དེ་དང་དེས་རྣམ་པར་རྩེ་བར་བྱའོ།
en: I should play with whatever meditative stabilities I desire to play with.

source: །གཟུངས་ཀྱི་སྒོ་ཐམས་ཅད་ཡོངས་སུ་བསྒྲུབ་པར་བྱའོ།
en: I should master all the dhāraṇī gateways.

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ཡོངས་སུ་བསྒྲུབ་པར་བྱའོ།
en: I should master the ten powers of the tathāgatas.

source: །མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཡོངས་སུ་བསྒྲུབ་པར་བྱའོ།
en: I should master the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas.’ “

source: །ཞེས་བྱ་བར་དམིགས་པའི་ཚུལ་གྱིས་གནས་པར་མི་བྱའོ། །ལུས་ལ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཡོངས་སུ་བསྒྲུབ་པར་བྱའོ། །དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་ཡོངས་སུ་བསྒྲུབ་པར་བྱའོ། ཞེས་བྱ་བར་དམིགས་པའི་ཚུལ་གྱིས་གནས་པར་མི་བྱའོ།
en: They should not, by way of apprehending, dwell on the notions, ‘I should attain the body of a great person, endowed with the thirty-two major marks,’ or ‘I should attain a body endowed with the eighty minor marks.’ “

source: །དད་པའི་རྗེས་སུ་འབྲང་བའོ་ཞེས་བྱ་བར་དམིགས་པའི་ཚུལ་གྱིས་གནས་པར་མི་བྱའོ། །ཆོས་ཀྱི་རྗེས་སུ་འབྲང་བའོ་བརྒྱད་པའོ་རྒྱུན་ཏུ་ཞུགས་པའོ་པོ་ཟོས་ན་ལན་བདུན་པའོ་རིགས་ནས་རིགས་སུ་འགྲོ་བའོ། གཅིག་གིས་ཆོད་པའོ་གང་ཟག་མགོ་མཉམ་པའོ་ཚེ་ཟད་པའོ་ཉོན་མོངས་པ་ཟད་པའོ།
en: They should not, by way of apprehending, dwell on the notions, ‘I am a follower on account of faith,’ or ‘I am a follower on account of the doctrine,’ or ‘I am on the eighth-lowest level,’ or ‘I am one who has entered the stream to nirvāṇa,’ or ‘I am one who will only be subject to rebirth seven more times,’ or ‘I will be reborn within an identical class [of gods or humans] over successive lives,’ or ‘I am one who has only a single further intervening rebirth,’ or ‘I am an individual on a par with those whose series of lives has ended, and whose afflicted mental states have ended.’ “

source: ཞེས་བྱ་བར་དམིགས་པའི་ཚུལ་གྱིས་གནས་པར་མི་བྱའོ།
en: They should not, by way of apprehending, dwell on the notion, ‘I am one who has entered the stream to nirvāṇa.’

source: །རྒྱུན་དུ་ཞུགས་པའོ་ཞེས་བྱ་བར་དམིགས་པའི་ཚུལ་གྱིས་གནས་པར་མི་བྱའོ། །ལན་ཅིག་ཕྱིར་འོང་བ་སྟེ་འཇིག་རྟེན་འདིར་ལན་ཅིག་ཕྱིར་འོངས་ནས་སྡུག་བསྔལ་མཐར་འབྱིན་ཏོ། །ཕྱིར་མི་འོང་བའི་འབྲས་བུ་མངོན་དུ་བྱ་བའི་ཕྱིར་ཞུགས་པའོ། །ཕྱིར་མི་འོང་བ་སྟེ་དེ་ཉིད་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བའོ། །དགྲ་བཅོམ་པའི་འབྲས་བུ་མངོན་དུ་བྱ་བའི་ཕྱིར་ཞུགས་པའོ་དགྲ་བཅོམ་པ་སྟེ།
en: They should not, by way of apprehending, dwell on the notions, ‘I, having reentered this world for the last time, as one destined for only one more rebirth, will bring suffering to an end,’ or ‘I have entered [this world] in order to manifest the fruit of one no longer subject to rebirth,’ or ‘I, as one no longer subject to rebirth, will attain final nirvāṇa in this life,’ or ‘I have entered [this world] in order to manifest the fruit of arhatship,’ {Ki.

source: ཚེ་འདི་ཉིད་ལ་ཕུང་པོ་མ་ལུས་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་མྱ་ངན་ལས་འདའ་བའོ།
en: II-III: 10} or ‘In this very lifetime I will attain final nirvāṇa in the expanse of nirvāṇa where no residue of the psycho-physical aggregates is left behind,’ or ‘I am a pratyekabuddha.’ “

source: །རང་སངས་རྒྱས་སོ་ཞེས་བྱ་བར་དམིགས་པའི་ཚུལ་གྱིས་གནས་པར་མི་བྱའོ། །ཉན་ཐོས་ཀྱི་ས་དང་རང་སངས་རྒྱས་ཀྱི་ས་ལས་བཟླས་ཏེ་བྱང་ཆུབ་སེམས་དཔའི་ས་ལ་གནས་པར་བྱའོ།
en: They should not, by way of apprehending, dwell on the notion, ‘I should transcend the level of the śrāvakas and the level of the pratyekabuddhas, and dwell on the levels of the bodhisattvas.’ “

source: །ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ཀྱི་ཡེ་ཤེས་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡེ་ཤེས་ལ་གནས་པར་བྱའོ་ཞེས་བྱ་བར་དམིགས་པའི་ཚུལ་གྱིས་གནས་པར་མི་བྱའོ། །རྣམ་པ་ཐམས་ཅད་དུ་ཆོས་ཐམས་ཅད་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས།
en: They should not, by way of apprehending, dwell on the notion, ‘I should dwell in the wisdom that is knowledge of the path and in the wisdom of all-aspect omniscience.’ “

source: བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བའི་ཉོན་མོངས་པ་ཐམས་ཅད་ཟད་པར་བྱའོ། །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་བྱའོ། །སངས་རྒྱས་ཀྱི་བྱ་བ་བྱས་ཏེ། འཇིག་རྟེན་གྱི་ཁམས་ཚད་མེད་གྲངས་མེད་པར་སོང་སྟེ། སེམས་ཅན་རྣམས་ཡོངས་སུ་མྱ་ངན་ལས་བཟླའོ་ཞེས་བྱ་བར་དམིགས་པའི་ཚུལ་གྱིས་གནས་པར་མི་བྱའོ།
en: They should not, by way of apprehending, dwell on the notions, ‘I, having attained consummate buddhahood with respect to all phenomena and in all ways, should end all afflicted mental states arising through connecting propensities,’ or ‘I, having attained unsurpassed, completely awakened buddhahood, should turn the wheel of the Dharma,’ or ‘I, having enacted the deeds of the buddhas, should proceed to inestimable, countless world systems and bring beings to attain final nirvāṇa.’ “

source: །རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་ལ་གནས་ཏེ་ཏིང་ངེ་འཛིན་གང་ལ་སྙོམས་པར་ཞུགས་པས་བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་གནས་པར་འགྱུར་བ་དེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་ལ་མཉམ་པར་གཞག་གོ་ཞེས་བྱ་བར་དམིགས་པའི་ཚུལ་གྱིས་གནས་པར་མི་བྱའོ།
en: They should not, by way of apprehending, dwell on the notion, ‘I, abiding in the four supports for miraculous ability, should enter into and become absorbed in such meditative stabilities that would enable me to remain for eons, as numerous as the grains of sand of the river Gaṅgā.’ “

source: །བདག་གི་ཚེ་ནི་ཚད་མེད་པར་གྱུར་ཅིག་ཅེས་བྱ་བར་དམིགས་པའི་ཚུལ་གྱིས་གནས་པར་མི་བྱའོ།
en: They should not, by way of apprehending, dwell on the notion, ‘May the limit of my lifespan be inestimable!’

source: །བདག་གིས་སྐྱེས་བུ་ཆེན་པོའི་སུམ་ཅུ་རྩ་གཉིས་ལས་མཚན་རེ་རེ་ཞིང་ཡང་བསོད་ནམས་བརྒྱས་ཡོངས་སུ་གྲུབ་པར་གྱུར་ཅིག་ཅེས་བྱ་བར་དམིགས་པའི་ཚུལ་གྱིས་གནས་པར་མི་བྱའོ།
en: They should not, by way of apprehending, dwell on the notion, ‘May I possess the thirty-two major marks of a great person, and consummate each of these with one hundred merits!’

source: །ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ལ་རྒྱ་ཇི་ཙམ་ཡོད་པ་དང་། ལྷོ་དང་ནུབ་དང་བྱང་དང་བྱང་ཤར་དང་ཤར་ལྷོ་དང་ལྷོ་ནུབ་དང་། ནུབ་བྱང་གི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ལ་རྒྱ་ཇི་ཙམ་ཡོད་པ་དེ་ཙམ་གྱི་ཐ་གྲུར་བདག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་གཅིག་བསྒྲུབ་བོ་ཞེས་བྱ་བར་དམིགས་པའི་ཚུལ་གྱིས་གནས་པར་མི་བྱའོ།
en: They should not, by way of apprehending, dwell on the notion, ‘May my single buddhafield equal in its extent the world systems of the eastern direction, numerous as the grains of sand of the river Gaṅgā, and may it equal in its extent the world systems of the southern, western, northern, northeastern, southeastern, southwestern, and northwestern directions, numerous as the grains of sand of the river Gaṅgā!’ “

source: །བདག་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་རྡོ་རྗེའི་རྒྱུ་ལས་གྲུབ་པར་གྱུར་ཅིག་ཅེས་བྱ་བར་དམིགས་པའི་ཚུལ་གྱིས་གནས་པར་མི་བྱའོ།
en: They should not, by way of apprehending, dwell the notion, ‘May the world systems of this, my great trichiliocosm, be fashioned of indestructible reality!’

source: །བདག་གིས་བྱང་ཆུབ་ཀྱི་ཤིང་གི་དྲི་སེམས་ཅན་གང་གིས་ཚོར་ཡང་རུང་སྟེ། དེ་དག་ལ་འདོད་ཆགས་དང་ཞེ་སྡང་དང་གཏི་མུག་གི་གནོད་པ་མེད་པར་གྱུར་ཅིག །ཉན་ཐོས་ཀྱི་སེམས་དང་རང་སངས་རྒྱས་ཀྱི་སེམས་བསྐྱེད་པར་མ་གྱུར་ཅིག་ཅེས་བྱ་བར་དམིགས་པའི་ཚུལ་གྱིས་གནས་པར་མི་བྱའོ།
en: They should not, by way of apprehending, dwell on the notion, ‘May the harmful influence of the desire, hatred, and delusion of those beings who have scented the fragrance of my Tree of Enlightenment be eliminated, and may they not cultivate the mindsets of the śrāvakas or pratyekabuddhas!’ “

source: །དེ་དག་ཐམས་ཅད་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ངེས་པར་གྱུར་ཅིག་ཅེས་བྱ་བ་དང་། སེམས་ཅན་གང་གིས་བྱང་ཆུབ་ཀྱི་ཤིང་གི་དྲི་དེ་ཚོར་བར་གྱུར་པ་དེ་དག་གིས་ལུས་སམ་སེམས་ལ་ནད་གང་ཡང་མེད་པར་གྱུར་ཅིག་ཅེས་བྱ་བར་དམིགས་པའི་ཚུལ་གྱིས་གནས་པར་མི་བྱའོ།
en: They should not, by way of apprehending, dwell on the notion, ‘May they all indeed be assured of unsurpassed, complete enlightenment, and may those beings who have scented the fragrance of my Tree of Enlightenment be without physical or mental ailments!’ “

source: །བདག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་དེར་གཟུགས་ཀྱི་སྒྲ་ཡོད་པར་མ་གྱུར་ཅིག་ཅེས་བྱ་བར། དམིགས་པའི་ཚུལ་གྱིས་གནས་པར་མི་བྱའོ།
en: They should not, by way of apprehending, dwell on the notion, ‘In this, my buddhafield, may the term physical forms not exist!’

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པའི་སྒྲ་ཡོད་པར་མ་གྱུར་ཅིག་ཅེས། བྱ་བར་དམིགས་པའི་ཚུལ་གྱིས་གནས་པར་མི་བྱའོ།།ཁམས་དང་སྐྱེ་མཆེད་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་སྒྲ་ཡོད་པར་མ་གྱུར་ཅིག་ཅེས། བྱ་བར་དམིགས་པའི་ཚུལ་གྱིས་གནས་པར་མི་བྱའོ།
en: They should not, by way of apprehending, dwell on the notion, ‘May the terms feelings, perceptions, formative predispositions, and consciousness not exist!’

source: །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའི་སྒྲ་ཡོད་པར་མ་གྱུར་ཅིག །
en: They should not, by way of apprehending, dwell on the notion, ‘In this, my buddhafield, may the terms sense fields, sensory elements, and links of dependent origination not exist!’

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་སྒྲ་ཡོད་པར་མ་གྱུར་ཅིག །
en: They should not, by way of apprehending, dwell on the notions, ‘In this, my buddhafield, may the terms perfection of generosity, perfection of ethical discipline, perfection of tolerance, perfection of perseverance, perfection of meditative concentration, and perfection of wisdom not exist!

source: ནང་སྟོང་པ་ཉིད་ཀྱི་སྒྲ་ཡོད་པར་མ་གྱུར་ཅིག །
en: May the term emptiness of internal phenomena not exist!

source: ཕྱི་སྟོང་པ་ཉིད་ཀྱི་སྒྲ་ཡོད་པར་མ་གྱུར་ཅིག །
en: May the term emptiness of external phenomena not exist!

source: ཕྱི་ནང་སྟོང་པ་ཉིད་ཀྱི་སྒྲ་ཡོད་པར་མ་གྱུར་ཅིག །
en: May the term emptiness of external and internal phenomena not exist!

source: དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་གྱི་སྒྲ་ཡོད་པར་མ་གྱུར་ཅིག་ཅེས།
en: May the terms corresponding to [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities not exist!’ “

source: བྱ་བར་དམིགས་པའི་ཚུལ་གྱིས་གནས་པར་མི་བྱའོ། །དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཀྱི་སྒྲ་ཡོད་པར་མ་གྱུར་ཅིག །ཡང་དག་པར་སྤོང་བ་དང་།
en: They should not, by way of apprehending, dwell on the notions, ‘In this, my buddhafield, may the term applications of mindfulness not exist!

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་སྒྲ་ཡོད་པར་མ་གྱུར་ཅིག །འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་རྣམས་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་།
en: May the terms correct exertions, supports for miraculous ability, faculties, powers, branches of enlightenment, and noble eightfold path not exist!

source: ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་།
en: May the terms truths of the noble ones, meditative concentrations, immeasurable attitudes, formless absorptions, aspects of liberation, serial steps of meditative absorption, gateways of liberation—emptiness, signlessness, and wishlessness—extrasensory powers, meditative stabilities, dhāraṇī gateways, powers of the tathāgatas, fearlessnesses, kinds of exact knowledge, great loving kindness, great compassion, and distinct qualities of the buddhas not exist!’ “

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱི་སྒྲ་ཡོད་པར་མ་གྱུར་ཅིག་ཅེས། བྱ་བར་དམིགས་པའི་ཚུལ་གྱིས་གནས་པར་མི་བྱའོ།
en: They should not, by way of apprehending, dwell on the notions, ‘[In this, my buddhafield], may the term one who enters the stream to nirvāṇa not exist!

source: །རྒྱུན་ཏུ་ཞུགས་པའི་སྒྲ་ཡོད་པར་མ་གྱུར་ཅིག །ལན་ཅིག་ཕྱིར་འོང་བའི་སྒྲ་དང་། ཕྱིར་མི་འོང་བའི་སྒྲ་དང་།
en: May the term one who is destined for only one more rebirth, the term one no longer subject to rebirth, and the term arhatship not exist!’

source: དགྲ་བཅོམ་པའི་སྒྲ་ཡོད་པར་མ་གྱུར་ཅིག་ཅེས་བྱ་བར་དམིགས་པའི་ཚུལ་གྱིས་གནས་པར་མི་བྱའོ། །རང་སངས་རྒྱས་ཀྱི་སྒྲ་ཡོད་པར་མ་གྱུར་ཅིག།
en: They should not, by way of apprehending, dwell on the notions, ‘[In this, my buddhafield], may the term pratyekabuddha not exist!

source: བྱང་ཆུབ་སེམས་དཔའི་སྒྲ་ཡོད་པར་མ་གྱུར་ཅིག །
en: May the term bodhisattva not exist!

source: སངས་རྒྱས་ཀྱི་སྒྲ་ཡོད་པར་མ་གྱུར་ཅིག་ཅེས་བྱ་བར་དམིགས་པའི་ཚུལ་གྱིས་གནས་པར་མི་བྱའོ།
en: May the term buddha not exist!’ “

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཀྱང་ཆོས་ཐམས་ཅད་མི་དམིགས་པའི་ཕྱིར་ཏེ།
en: If you ask why this is so, it is because once the tathāgatas, arhats, completely awakened buddhas have attained consummate buddhahood in unsurpassed, complete enlightenment, all phenomena are nonapprehensible. {

source: ཀཽ་ཤི་ཀ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་དམིགས་པའི་ཚུལ་གྱིས་གནས་པར་མི་བྱའོ།
en: Ki.II-III: 11} So it is, Kauśika, that bodhisattva great beings should not dwell on the perfection of wisdom.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདི་སྙམ་སྟེ། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་པར་བྱ་སྙམ་པ་དང་།
en: Then the venerable Śāradvatīputra thought, “How should bodhisattva great beings dwell on the perfection of wisdom?”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཀྱིས། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུའི་སེམས་ཀྱི་རྣམ་པར་རྟོག་པ་སེམས་ཀྱིས་ཡོངས་སུ་ཤེས་ནས། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཅི་ཞིག་ལ་གནས།
en: Thereupon the venerable Subhūti, knowing in his own mind the thoughts of the venerable Śāradvatīputra, addressed the latter as follows: “Venerable Śāradvatīputra, do you think that the tathāgatas, arhats, completely awakened buddhas dwell on anything?” “

source: སྨྲས་པ་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་ནི་ཅི་ལ་ཡང་གནས་པ་མ་ཡིན་ནོ། །ཚེ་དང་ལྡན་པ་རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ཐུགས་ནི། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མི་གནས།
en: Venerable Subhūti,” he replied, “the tathāgatas do not dwell on anything at all.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མི་གནས་སོ།
en: Venerable Subhūti, the mind of the tathāgatas, arhats, completely awakened buddhas does not dwell on the perfection of generosity, and it does not dwell on the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, or the perfection of wisdom.

source: །དེ་གཟུགས་ལ་མི་གནས་སོ།
en: It does not dwell on physical forms.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལ་མི་གནས་སོ། །སྐྱེ་མཆེད་དང་ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལ་མི་གནས།
en: It does not dwell on feelings, perceptions, formative predispositions, or consciousness. It does not dwell on the sense fields, the sensory elements, or the links of dependent origination.

source: ནང་སྟོང་པ་ཉིད་ལ་མི་གནས།
en: It does not dwell on the emptiness of internal phenomena.

source: ཕྱི་སྟོང་པ་ཉིད་ལ་མི་གནས།
en: It does not dwell on the emptiness of external phenomena.

source: ཕྱི་ནང་སྟོང་པ་ཉིད་ལ་མི་གནས།
en: It does not dwell on the emptiness of external and internal phenomena.

source: དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་མི་གནས་སོ། །༈། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ། བམ་པོ་ཉེར་བརྒྱད་པ།
en: It does not dwell on the [other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities. “

source: བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་བཅུ་རྩ་བདུན་ལ་མི་གནས་སོ། །འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་།
en: It does not dwell on the thirty-seven factors of enlightenment.

source: རྣམ་པར་ཐར་པ་བརྒྱད་དང་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་གཟུངས་ཀྱི་སྒོ་རྣམས་ལ་མི་གནས། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་མི་གནས་སོ།
en: It does not dwell on the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, or the eighteen distinct qualities of the buddhas.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་མི་གནས་སོ། །རབ་འབྱོར་གྱིས་སྨྲས་པ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ནི། ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གཟུགས་ལ་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན། ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལ་གནས་པ་ཡང་མ་ཡིན་མི་གནས་པ་ཡང་མ་ཡིན།
en: It does not dwell on all-aspect omniscience.”

source: མིག་ལ་གནས་པ་ཡང་མ་ཡིན་མི་གནས་པ་ཡང་མ་ཡིན། རྣ་བ་དང་སྣ་དང་ལྕེ་དང་ལུས་དང་ཡིད་ལ་གནས་པ་ཡང་མ་ཡིན་མི་གནས་པ་ཡང་མ་ཡིན། གཟུགས་ལ་གནས་པ་ཡང་མ་ཡིན་མི་གནས་པ་ཡང་མ་ཡིན། སྒྲ་དང་དྲི་དང་རོ་དང་རེག་དང་ཆོས་ལ་གནས་པ་ཡང་མ་ཡིན་མི་གནས་པ་ཡང་མ་ཡིན། མིག་གི་རྣམ་པར་ཤེས་པ་ལ་གནས་པ་ཡང་མ་ཡིན་མི་གནས་པ་ཡང་མ་ཡིན། རྣ་བའི་རྣམ་པར་ཤེས་པ་དང་། སྣའི་རྣམ་པར་ཤེས་པ་དང་། ལྕེའི་རྣམ་པར་ཤེས་པ་དང་། ལུས་ཀྱི་རྣམ་པར་ཤེས་པ་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་ལ་གནས་པ་ཡང་མ་ཡིན་མི་གནས་པ་ཡང་མ་ཡིན། མིག་གི་འདུས་ཏེ་རེག་པ་ལ་གནས་པ་ཡང་མ་ཡིན་མི་གནས་པ་ཡང་མ་ཡིན། རྣ་བའི་འདུས་ཏེ་རེག་པ་དང་། སྣའི་འདུས་ཏེ་རེག་པ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་ལ་གནས་པ་ཡང་མ་ཡིན་མི་གནས་པ་ཡང་མ་ཡིན། མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་ལ་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན། རྣ་བའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། སྣའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་ལ་གནས་པ་ཡང་མ་ཡིན་མི་གནས་པ་ཡང་མ་ཡིན། སའི་ཁམས་ལ་གནས་པ་ཡང་མ་ཡིན་མི་གནས་པ་ཡང་མ་ཡིན། ཆུའི་ཁམས་དང་མེའི་ཁམས་དང་། རླུང་གི་ཁམས་དང་། ནམ་མཁའི་ཁམས་དང་། རྣམ་པར་ཤེས་པའི་ཁམས་ལ་གནས་པ་ཡང་མ་ཡིན་མི་གནས་པ་ཡང་མ་ཡིན། མ་རིག་པ་ལ་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན། འདུ་བྱེད་དང་རྣམ་པར་ཤེ
en: Subhūti then said, “Venerable Śāradvatīputra, bodhisattva great beings should dwell on the perfection of wisdom in the same way that the tathāgatas, arhats, completely awakened buddhas neither dwell, nor do they not dwell on physical forms; just as they neither dwell, nor do they not dwell on feelings, perceptions, formative predispositions, or consciousness; just as they neither dwell, nor do they not dwell on the eyes; just as they neither dwell, nor do they not dwell on the ears, nose, tongue, body, or mental faculty; just as they neither dwell, nor do they not dwell on sights; just as they neither dwell, nor do they not dwell on sounds, odors, tastes, tangibles, or mental phenomena; just as they neither dwell, nor do they not dwell on visual consciousness; just as they neither dwell, nor do they not dwell on auditory consciousness, olfactory consciousness, gustatory consciousness, tactile consciousness, or mental consciousness; just as they neither dwell, nor do they not dwell on visually compounded sensory contact; just as they neither dwell, nor do they not dwell on aurally compounded sensory contact, nasally compounded sensory contact, lingually compounded sensory contact, corporeally compounded sensory contact, or mentally compounded sensory contact; just as they neither dwell, nor do they not dwell on feelings conditioned by visually compounded sensory contact; just as they neither dwell, nor do they not dwell on feelings conditioned by aurally compounded sensory contact, feelings conditioned by nasally compounded sensory contact, feelings conditioned by lingually compounded sensory contact, feelings conditioned by corporeally compounded sensory contact, or feelings conditioned by mentally compounded sensory contact; just as they neither dwell, nor do they not dwell on the earth element; just as they neither dwell, nor do they not dwell on the water element, the fire element, the wind element, the space element, or the consciousness element; just as they neither dwell, nor do they not dwell on ignorance; just as they neither dwell, nor do they not dwell on formative predispositions, consciousness, name and form, the six sense fields, sensory contact, sensation, craving, grasping, the rebirth process, actual birth, or aging and death; just as they neither dwell, nor do they not dwell on the perfection of generosity; just as they neither dwell, nor do they not dwell on the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, or the perfection of wisdom; just as they neither dwell, nor do they not dwell on the emptiness of internal phenomena; just as they neither dwell, nor do they not dwell on [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities; just as they neither dwell, nor do they not dwell on the applications of mindfulness; just as they neither dwell, nor do they not dwell on the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, or the noble eightfold path; just as they neither dwell, nor do they not dwell on the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, or the eighteen distinct qualities of the buddhas; and just as they neither dwell, nor do they not dwell on [the fruits and realizations], up to and including all-aspect omniscience.
